package lesson_e;

/**
 1.	Создать классы Собака, Лошадь, Птица и Кот с наследованием от класса Животное.
 2.	Животные могут выполнять действия: бежать, плыть, перепрыгивать препятствие.
 В качестве параметра каждому методу передается величина,
 означающая или длину препятствия (для бега и плавания), или высоту (для прыжков).
 3.	У каждого животного есть ограничения на действия (бег: кот 200 м., собака 500 м.,
 Лошадь 1500 м., Птица 5 м.,; прыжок: кот 2 м., собака 0.5 м., Лошадь 3 м., Птица 0.2 м.;
 плавание: кот и птица не умеет плавать, собака 10 м., лошадь 100 м.).
 4.	При попытке животного выполнить одно из этих действий, оно должно сообщить результат.
 (Например, dog1.run(150); -> результат: 'Пёсик пробежал!')
 5.	Добавить животным разброс в ограничениях.
 То есть у одной собаки ограничение на бег может быть 400 м., у другой 600 м.
 */

public class Marathon {
    public static void main(String[] args) {

        Cat c = new Cat("Barsik", 2, 200, 1);
        Dog d = new Dog("Tuzik", 0.5f, 500, 10);

        Animal[] arr = {c, d};
        float toJump = 1.5f;
        float toRun = 350;
        float toSwim = 5;

        for (int i = 0; i < arr.length; i++) {
            String nameString = arr[i].getType() + " " + arr[i].getName() + " can ";

            String eventName = String.format("jump max %.2fm. Tries to jump ", arr[i].getMaxJump());
            String eventResult = (arr[i].jump(toJump)) ? "succeed" : "fails";
            System.out.println(nameString + eventName + toJump + "m and " + eventResult);

            eventName = String.format("run max %.2fm. Tries to run ", arr[i].getMaxRun());
            eventResult = arr[i].run(toRun) ? "succeed" : "fails";
            System.out.println(nameString + eventName + toRun + "m and " + eventResult);

            int swimResult = arr[i].swim(toSwim);
            eventName = String.format("swim max %.2fm. Tries to swim ", arr[i].getMaxSwim());
            eventResult = (swimResult == Animal.SWIM_OK) ? "succeed" : "fails";
            if (swimResult == Animal.SWIM_WTF)
                eventResult = "too scared to enter the water";
            System.out.println(nameString + eventName + toSwim + "m and " + eventResult);
        }
    }
}